Page({

  /**
   * 页面的初始数据
   */
  data: {
    array:[
      {name:"zhangsan",age:"1"},
      {name:"wangwu",age:"2"},
      { name: "zhangsang", age: "3" },
      { name: "wangwun", age: "4" },
      { name: "zhansan", age: "5" },
    ],
    viewId:"",
    
    cityMessage: {
      "trainStation": [
      ],
      "airportStation": [
        "阿克苏机场",
        "阿勒泰机场",
        "鞍山机场",
        "安康机场",
        "安庆(天柱山）机场",
        "安阳北郊机场",
        "蚌埠机场",
        "包头二里半机场",
        "保山云瑞机场",
        "北海福城机场",
        "北京首都机场",
        "常德桃花源(斗姆湖)机场",
        "常州奔牛机场",
        "长春龙嘉国际机场",
        "长沙黄花机场",
        "长治王村机场",
        "成都双流机场",
        "赤峰玉龙机场",
        "达州(河市)机场",
        "大理荒草坝机场",
        "大连国际机场",
        "丹东浪头机场",
        "迪庆香格里拉机场",
        "敦煌机场",
        "鄂尔多斯伊金霍洛机场",
        "恩施机场",
        "福州长乐机场",
        "阜阳西关机场",
        "富蕴机场",
        "赣州黄金机场",
        "高雄机场",
        "格尔木机场",
        "广汉机场",
        "广西梧州长洲岛机场",
        "广州白云机场",
        "桂林两江机场",
        "贵阳龙洞堡机场",
        "哈尔滨太平机场",
        "哈密机场",
        "海口美兰机场",
        "汉中西关机场",
        "杭州萧山机场",
        "和田机场",
        "合肥骆岗机场",
        "黑河机场",
        "衡阳东江机场",
        "呼和浩特白塔国际机场",
        "怀化芷江机场",
        "黄山屯溪机场",
        "吉安机场",
        "吉林二台子机场",
        "济南遥墙机场",
        "济宁机场",
        "嘉义机场",
        "嘉峪关机场",
        "佳木斯机场",
        "江苏盐城南洋机场",
        "揭阳潮汕机场",
        "锦州小岭子机场",
        "荆州沙市机场",
        "景德镇罗家机场",
        "景洪(西双版纳)机场",
        "九江庐山机场",
        "九寨沟黄龙(九黄）机场",
        "酒泉机场",
        "喀什机场",
        "克拉玛依机场",
        "库车机场",
        "库尔勒机场",
        "昆明巫家坝机场",
        "拉萨贡嘎机场",
        "兰州机场",
        "丽江(云南丽江机场)",
        "丽江三义机场",
        "连云港白塔埠机场",
        "辽宁朝阳机场",
        "临沧机场",
        "临沂沭埠岭机场",
        "柳州白莲机场",
        "洛阳机场",
        "芒市机场",
        "梅县机场",
        "绵阳南郊机场",
        "牡丹江海浪机场",
        "南昌昌北机场",
        "南充高坪机场",
        "南京禄口机场",
        "南宁吴圩机场",
        "南通兴东机场",
        "南阳姜营机场",
        "内蒙古海拉尔东山机场",
        "宁波栎社机场",
        "普洱(思茅)机场",
        "齐齐哈尔三家子机场",
        "且末机场",
        "秦皇岛山海关机场",
        "青岛流亭机场",
        "庆阳机场",
        "泉州晋江机场",
        "三亚凤凰机场",
        "山西大同机场",
        "上海虹桥机场",
        "深圳宝安机场",
        "沈阳桃仙机场",
        "石家庄正定机场",
        "苏州机场",
        "塔城机场",
        "台北松山机场",
        "台东志航机场",
        "台南机场",
        "台中",
        "台州路桥（原黄岩路桥）机场",
        "太原武宿机场",
        "天津滨海机场",
        "通化机场",
        "通辽机场",
        "铜仁凤凰机场",
        "威海文登大水泊机场",
        "潍坊机场",
        "温州永强机场",
        "乌兰浩特机场",
        "乌鲁木齐地窝堡机场",
        "无锡硕放机场",
        "武汉天河机场",
        "武夷山机场",
        "西安咸阳机场",
        "西藏昌都邦达机场",
        "西昌青山机场",
        "西宁曹家堡机场",
        "锡林浩特机场",
        "厦门高崎机场",
        "襄阳刘集机场",
        "兴城机场",
        "徐州观音机场",
        "烟台莱山机场",
        "延安二十里铺机场",
        "延吉朝阳川机场",
        "伊宁机场",
        "宜宾(菜坝)机场",
        "宜昌三峡机场",
        "义乌机场",
        "银川河东机场",
        "榆林西沙机场",
        "云南文山普者黑机场",
        "湛江机场",
        "张家界荷花机场",
        "昭通机场",
        "郑州新郑机场",
        "重庆江北机场",
        "舟山普陀山朱家尖机场",
        "珠海三灶机场",
        "遵义机场",
        "衢州机场",
        "泸州蓝田机场"
      ]
    }
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
    
  },
  load: function() {
    //获取data里的array
    var array = this.data.array
    var items = [
      { name: "wanwu", age: "6" },
      { name: "zhasan", age: "7" },
      { name: "wanwun", age: "8" },
      { name: "zasa", age: "9" },
      { name: "wawu", age: "10" }
    ]
    // 向array添加元素
    for(var i = 0;i<5;i++){
      array.push(items[i])
    }
    // 将修改过的array赋值回去，并且改变锚点的位置，达到翻页的效果
    this.setData({
      array: array,
      viewId: "wanwu"
    })
  },
  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {
    
  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {
    
  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {
    
  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {
    
  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {
    
  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {
    
  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {
    
  }
})